{
  "places": [
    {
      "name": "The Bronze",
      "type": "Nightclub",
      "location": "Sunnydale, California",
      "description": "A popular nightclub for Sunnydale teens, and a frequent hangout spot for the Scooby Gang. The Bronze also hosts live performances by musical guests and is often the site of supernatural incidents."
    },
    {
      "name": "Sunnydale High School",
      "type": "High School",
      "location": "Sunnydale, California",
      "description": "The high school attended by Buffy and her friends, and a focal point of many supernatural occurrences in Sunnydale. It was built on top of a Hellmouth, making it a hotbed of supernatural activity."
    },
    {
      "name": "Watcher's Council Headquarters",
      "type": "Organization Headquarters",
      "location": "London, England",
      "description": "The headquarters of the Watcher's Council, an organization dedicated to training and supporting Watchers and Slayers in their fight against evil. The Council has a vast library of occult knowledge and resources at their disposal."
    },
    {
      "name": "Wolfram & Hart",
      "type": "Law Firm",
      "location": "Los Angeles, California",
      "description": "A powerful law firm that represents demons and other supernatural beings. Wolfram & Hart is also involved in numerous illicit activities, and is a major player in the supernatural world."
    },
    {
      "name": "The Hyperion Hotel",
      "type": "Hotel",
      "location": "Los Angeles, California",
      "description": "A historic hotel in Los Angeles that was used as the headquarters for Angel Investigations. The Hyperion also served as a sanctuary for a variety of supernatural beings, and was frequently the site of battles between good and evil."
    },
    {
      "name": "Buffy's House",
      "address": "1630 Revello Drive, Sunnydale, California",
      "description": "Buffy's house is a two-story suburban house located in Sunnydale. It has a front yard and a backyard, and a spacious interior with multiple rooms. Buffy lives here with her mother Joyce until her death in season five, after which she shares the house with her sister Dawn.",
      "notable_residents": [
        {
          "name": "Buffy Summers",
          "role": "Owner/Resident"
        },
        {
          "name": "Joyce Summers",
          "role": "Resident (Deceased)"
        },
        {
          "name": "Dawn Summers",
          "role": "Resident"
        }
      ],
      "notable_events": [
        "The Scooby Gang frequently meets here to discuss their plans for battling evil in Sunnydale",
        "Angel loses his soul and becomes Angelus in Buffy's bedroom",
        "Joyce Summers dies of a brain aneurysm in the living room",
        "Dawn is revealed to be the Key in the living room"
      ]
    },
    {
      "name": "Magic Box",
      "address": "Sunnydale, California",
      "description": "The Magic Box is a magic shop in Sunnydale owned by Rupert Giles. It is a popular location for the Scooby Gang to purchase magical supplies and weapons, as well as a place for them to research information on demons and other supernatural entities. The shop is also frequently targeted by demons and other evil beings.",
      "owner": {
        "name": "Rupert Giles",
        "role": "Owner/Resident"
      },
      "notable_residents": [
        {
          "name": "Anya Jenkins",
          "role": "Employee/Resident"
        }
      ],
      "notable_events": [
        "The Scooby Gang purchases magical supplies and weapons from the Magic Box",
        "Dawn and Spike attempt to rob the Magic Box for money and magical artifacts",
        "Willow casts a spell to make everyone in the Magic Box forget who they are, causing chaos"
      ]
    },
    {
      "name": "Sunnydale High School Library",
      "address": "Sunnydale, California",
      "description": "The Sunnydale High School Library is a central location for the Scooby Gang to conduct research and investigate supernatural occurrences. It is managed by Rupert Giles, who serves as the school's librarian.",
      "owner": {
        "name": "Rupert Giles",
        "role": "Librarian"
      },
      "notable_residents": [
        {
          "name": "Rupert Giles",
          "role": "Librarian"
        }
      ],
      "notable_events": [
        "The Scooby Gang researches and discovers the existence of the Hellmouth in the library",
        "Buffy fights the Master and is killed in the library",
        "The library is destroyed by the mayor during the battle for Sunnydale"
      ]
    },
    {
      "name": "Sunnydale Graveyard",
      "address": "Sunnydale, California",
      "description": "The Sunnydale Graveyard is a location where many supernatural events take place. It is a common location for vampires to rise from their graves, and a frequent site of battles between the Scooby Gang and various supernatural foes.",
      "owner": null,
      "notable_residents": [
        {
          "name": "The Master",
          "role": "Vampire Master"
        },
        {
          "name": "Spike",
          "role": "Vampire"
        },
        {
          "name": "Angel",
          "role": "Vampire"
        }
      ],
      "notable_events": [
        "Buffy and Angel fight in the graveyard",
        "The Master performs a ritual to open the Hellmouth in the graveyard",
        "Buffy and her friends battle a group of demons in the graveyard"
      ]
    }
  ]
}
